(union isfuzzy=true (DeviceEvents
| where Timestamp > ago(30m)
| where ActionType =~ "LdapSearch"
| where InitiatingProcessVersionInfoInternalFileName contains "Powershell"
),
(IdentityDirectoryEvents
| where Timestamp > ago(30m)
| where ActionType contains "replication"
),
(CloudAppEvents 
| where Timestamp > ago(30m)
| where ActionType == "MailItemsAccessed" 
| where RawEventData has "00000003-0000-0000-c000-000000000000" 
| extend rawData = parse_json(RawEventData) 
| extend AppId = tostring(parse_json(rawData.AppId)) 
| extend OAuthAppId = tostring(parse_json(rawData.ClientAppId))
))